bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/mmsys_misc_reg.h
/*
 * Copyright (c) 2016-2022 Bouffalolab.
 *
 * This file is part of
 *     *** Bouffalolab Software Dev Kit ***
 *      (see www.bouffalolab.com).
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#ifndef  __MMSYS_MISC_REG_H__
#define  __MMSYS_MISC_REG_H__

#include "bl808.h"

/* 0x0 : a5_boot */
#define MMSYS_MISC_A5_BOOT_OFFSET                               (0x0)
#define MMSYS_MISC_REG_A5_BOOT_EN                               MMSYS_MISC_REG_A5_BOOT_EN
#define MMSYS_MISC_REG_A5_BOOT_EN_POS                           (0U)
#define MMSYS_MISC_REG_A5_BOOT_EN_LEN                           (1U)
#define MMSYS_MISC_REG_A5_BOOT_EN_MSK                           (((1U<<MMSYS_MISC_REG_A5_BOOT_EN_LEN)-1)<<MMSYS_MISC_REG_A5_BOOT_EN_POS)
#define MMSYS_MISC_REG_A5_BOOT_EN_UMSK                          (~(((1U<<MMSYS_MISC_REG_A5_BOOT_EN_LEN)-1)<<MMSYS_MISC_REG_A5_BOOT_EN_POS))
#define MMSYS_MISC_REG_A5_BOOT_ADDR                             MMSYS_MISC_REG_A5_BOOT_ADDR
#define MMSYS_MISC_REG_A5_BOOT_ADDR_POS                         (1U)
#define MMSYS_MISC_REG_A5_BOOT_ADDR_LEN                         (31U)
#define MMSYS_MISC_REG_A5_BOOT_ADDR_MSK                         (((1U<<MMSYS_MISC_REG_A5_BOOT_ADDR_LEN)-1)<<MMSYS_MISC_REG_A5_BOOT_ADDR_POS)
#define MMSYS_MISC_REG_A5_BOOT_ADDR_UMSK                        (~(((1U<<MMSYS_MISC_REG_A5_BOOT_ADDR_LEN)-1)<<MMSYS_MISC_REG_A5_BOOT_ADDR_POS))

/* 0x20 : peri_apb_ctrl */
#define MMSYS_MISC_PERI_APB_CTRL_OFFSET                         (0x20)
#define MMSYS_MISC_RG_PCLK_FORCE_ON                             MMSYS_MISC_RG_PCLK_FORCE_ON
#define MMSYS_MISC_RG_PCLK_FORCE_ON_POS                         (0U)
#define MMSYS_MISC_RG_PCLK_FORCE_ON_LEN                         (16U)
#define MMSYS_MISC_RG_PCLK_FORCE_ON_MSK                         (((1U<<MMSYS_MISC_RG_PCLK_FORCE_ON_LEN)-1)<<MMSYS_MISC_RG_PCLK_FORCE_ON_POS)
#define MMSYS_MISC_RG_PCLK_FORCE_ON_UMSK                        (~(((1U<<MMSYS_MISC_RG_PCLK_FORCE_ON_LEN)-1)<<MMSYS_MISC_RG_PCLK_FORCE_ON_POS))

/* 0x2C : mm_infra_qos_ctrl */
#define MMSYS_MISC_MM_INFRA_QOS_CTRL_OFFSET                     (0x2C)
#define MMSYS_MISC_REG_DMA_AWQOS                                MMSYS_MISC_REG_DMA_AWQOS
#define MMSYS_MISC_REG_DMA_AWQOS_POS                            (0U)
#define MMSYS_MISC_REG_DMA_AWQOS_LEN                            (1U)
#define MMSYS_MISC_REG_DMA_AWQOS_MSK                            (((1U<<MMSYS_MISC_REG_DMA_AWQOS_LEN)-1)<<MMSYS_MISC_REG_DMA_AWQOS_POS)
#define MMSYS_MISC_REG_DMA_AWQOS_UMSK                           (~(((1U<<MMSYS_MISC_REG_DMA_AWQOS_LEN)-1)<<MMSYS_MISC_REG_DMA_AWQOS_POS))
#define MMSYS_MISC_REG_DMA_ARQOS                                MMSYS_MISC_REG_DMA_ARQOS
#define MMSYS_MISC_REG_DMA_ARQOS_POS                            (1U)
#define MMSYS_MISC_REG_DMA_ARQOS_LEN                            (1U)
#define MMSYS_MISC_REG_DMA_ARQOS_MSK                            (((1U<<MMSYS_MISC_REG_DMA_ARQOS_LEN)-1)<<MMSYS_MISC_REG_DMA_ARQOS_POS)
#define MMSYS_MISC_REG_DMA_ARQOS_UMSK                           (~(((1U<<MMSYS_MISC_REG_DMA_ARQOS_LEN)-1)<<MMSYS_MISC_REG_DMA_ARQOS_POS))
#define MMSYS_MISC_REG_A5M0_AWQOS                               MMSYS_MISC_REG_A5M0_AWQOS
#define MMSYS_MISC_REG_A5M0_AWQOS_POS                           (2U)
#define MMSYS_MISC_REG_A5M0_AWQOS_LEN                           (1U)
#define MMSYS_MISC_REG_A5M0_AWQOS_MSK                           (((1U<<MMSYS_MISC_REG_A5M0_AWQOS_LEN)-1)<<MMSYS_MISC_REG_A5M0_AWQOS_POS)
#define MMSYS_MISC_REG_A5M0_AWQOS_UMSK                          (~(((1U<<MMSYS_MISC_REG_A5M0_AWQOS_LEN)-1)<<MMSYS_MISC_REG_A5M0_AWQOS_POS))
#define MMSYS_MISC_REG_A5M0_ARQOS                               MMSYS_MISC_REG_A5M0_ARQOS
#define MMSYS_MISC_REG_A5M0_ARQOS_POS                           (3U)
#define MMSYS_MISC_REG_A5M0_ARQOS_LEN                           (1U)
#define MMSYS_MISC_REG_A5M0_ARQOS_MSK                           (((1U<<MMSYS_MISC_REG_A5M0_ARQOS_LEN)-1)<<MMSYS_MISC_REG_A5M0_ARQOS_POS)
#define MMSYS_MISC_REG_A5M0_ARQOS_UMSK                          (~(((1U<<MMSYS_MISC_REG_A5M0_ARQOS_LEN)-1)<<MMSYS_MISC_REG_A5M0_ARQOS_POS))
#define MMSYS_MISC_REG_A5M1_AWQOS                               MMSYS_MISC_REG_A5M1_AWQOS
#define MMSYS_MISC_REG_A5M1_AWQOS_POS                           (4U)
#define MMSYS_MISC_REG_A5M1_AWQOS_LEN                           (1U)
#define MMSYS_MISC_REG_A5M1_AWQOS_MSK                           (((1U<<MMSYS_MISC_REG_A5M1_AWQOS_LEN)-1)<<MMSYS_MISC_REG_A5M1_AWQOS_POS)
#define MMSYS_MISC_REG_A5M1_AWQOS_UMSK                          (~(((1U<<MMSYS_MISC_REG_A5M1_AWQOS_LEN)-1)<<MMSYS_MISC_REG_A5M1_AWQOS_POS))
#define MMSYS_MISC_REG_A5M1_ARQOS                               MMSYS_MISC_REG_A5M1_ARQOS
#define MMSYS_MISC_REG_A5M1_ARQOS_POS                           (5U)
#define MMSYS_MISC_REG_A5M1_ARQOS_LEN                           (1U)
#define MMSYS_MISC_REG_A5M1_ARQOS_MSK                           (((1U<<MMSYS_MISC_REG_A5M1_ARQOS_LEN)-1)<<MMSYS_MISC_REG_A5M1_ARQOS_POS)
#define MMSYS_MISC_REG_A5M1_ARQOS_UMSK                          (~(((1U<<MMSYS_MISC_REG_A5M1_ARQOS_LEN)-1)<<MMSYS_MISC_REG_A5M1_ARQOS_POS))
#define MMSYS_MISC_REG_2DDMA_AWQOS                              MMSYS_MISC_REG_2DDMA_AWQOS
#define MMSYS_MISC_REG_2DDMA_AWQOS_POS                          (6U)
#define MMSYS_MISC_REG_2DDMA_AWQOS_LEN                          (1U)
#define MMSYS_MISC_REG_2DDMA_AWQOS_MSK                          (((1U<<MMSYS_MISC_REG_2DDMA_AWQOS_LEN)-1)<<MMSYS_MISC_REG_2DDMA_AWQOS_POS)
#define MMSYS_MISC_REG_2DDMA_AWQOS_UMSK                         (~(((1U<<MMSYS_MISC_REG_2DDMA_AWQOS_LEN)-1)<<MMSYS_MISC_REG_2DDMA_AWQOS_POS))
#define MMSYS_MISC_REG_2DDMA_ARQOS                              MMSYS_MISC_REG_2DDMA_ARQOS
#define MMSYS_MISC_REG_2DDMA_ARQOS_POS                          (7U)
#define MMSYS_MISC_REG_2DDMA_ARQOS_LEN                          (1U)
#define MMSYS_MISC_REG_2DDMA_ARQOS_MSK                          (((1U<<MMSYS_MISC_REG_2DDMA_ARQOS_LEN)-1)<<MMSYS_MISC_REG_2DDMA_ARQOS_POS)
#define MMSYS_MISC_REG_2DDMA_ARQOS_UMSK                         (~(((1U<<MMSYS_MISC_REG_2DDMA_ARQOS_LEN)-1)<<MMSYS_MISC_REG_2DDMA_ARQOS_POS))
#define MMSYS_MISC_REG_SDH_AWQOS                                MMSYS_MISC_REG_SDH_AWQOS
#define MMSYS_MISC_REG_SDH_AWQOS_POS                            (8U)
#define MMSYS_MISC_REG_SDH_AWQOS_LEN                            (1U)
#define MMSYS_MISC_REG_SDH_AWQOS_MSK                            (((1U<<MMSYS_MISC_REG_SDH_AWQOS_LEN)-1)<<MMSYS_MISC_REG_SDH_AWQOS_POS)
#define MMSYS_MISC_REG_SDH_AWQOS_UMSK                           (~(((1U<<MMSYS_MISC_REG_SDH_AWQOS_LEN)-1)<<MMSYS_MISC_REG_SDH_AWQOS_POS))
#define MMSYS_MISC_REG_SDH_ARQOS                                MMSYS_MISC_REG_SDH_ARQOS
#define MMSYS_MISC_REG_SDH_ARQOS_POS                            (9U)
#define MMSYS_MISC_REG_SDH_ARQOS_LEN                            (1U)
#define MMSYS_MISC_REG_SDH_ARQOS_MSK                            (((1U<<MMSYS_MISC_REG_SDH_ARQOS_LEN)-1)<<MMSYS_MISC_REG_SDH_ARQOS_POS)
#define MMSYS_MISC_REG_SDH_ARQOS_UMSK                           (~(((1U<<MMSYS_MISC_REG_SDH_ARQOS_LEN)-1)<<MMSYS_MISC_REG_SDH_ARQOS_POS))
#define MMSYS_MISC_REG_W_ISSUE_THRE_MM2CONN                     MMSYS_MISC_REG_W_ISSUE_THRE_MM2CONN
#define MMSYS_MISC_REG_W_ISSUE_THRE_MM2CONN_POS                 (16U)
#define MMSYS_MISC_REG_W_ISSUE_THRE_MM2CONN_LEN                 (3U)
#define MMSYS_MISC_REG_W_ISSUE_THRE_MM2CONN_MSK                 (((1U<<MMSYS_MISC_REG_W_ISSUE_THRE_MM2CONN_LEN)-1)<<MMSYS_MISC_REG_W_ISSUE_THRE_MM2CONN_POS)
#define MMSYS_MISC_REG_W_ISSUE_THRE_MM2CONN_UMSK                (~(((1U<<MMSYS_MISC_REG_W_ISSUE_THRE_MM2CONN_LEN)-1)<<MMSYS_MISC_REG_W_ISSUE_THRE_MM2CONN_POS))
#define MMSYS_MISC_REG_W_ISSUE_THRE_CONN2MM                     MMSYS_MISC_REG_W_ISSUE_THRE_CONN2MM
#define MMSYS_MISC_REG_W_ISSUE_THRE_CONN2MM_POS                 (20U)
#define MMSYS_MISC_REG_W_ISSUE_THRE_CONN2MM_LEN                 (3U)
#define MMSYS_MISC_REG_W_ISSUE_THRE_CONN2MM_MSK                 (((1U<<MMSYS_MISC_REG_W_ISSUE_THRE_CONN2MM_LEN)-1)<<MMSYS_MISC_REG_W_ISSUE_THRE_CONN2MM_POS)
#define MMSYS_MISC_REG_W_ISSUE_THRE_CONN2MM_UMSK                (~(((1U<<MMSYS_MISC_REG_W_ISSUE_THRE_CONN2MM_LEN)-1)<<MMSYS_MISC_REG_W_ISSUE_THRE_CONN2MM_POS))

/* 0x30 : mm_bus_dec_err */
#define MMSYS_MISC_MM_BUS_DEC_ERR_OFFSET                        (0x30)
#define MMSYS_MISC_REG_DEC_ERR_CLR                              MMSYS_MISC_REG_DEC_ERR_CLR
#define MMSYS_MISC_REG_DEC_ERR_CLR_POS                          (0U)
#define MMSYS_MISC_REG_DEC_ERR_CLR_LEN                          (1U)
#define MMSYS_MISC_REG_DEC_ERR_CLR_MSK                          (((1U<<MMSYS_MISC_REG_DEC_ERR_CLR_LEN)-1)<<MMSYS_MISC_REG_DEC_ERR_CLR_POS)
#define MMSYS_MISC_REG_DEC_ERR_CLR_UMSK                         (~(((1U<<MMSYS_MISC_REG_DEC_ERR_CLR_LEN)-1)<<MMSYS_MISC_REG_DEC_ERR_CLR_POS))
#define MMSYS_MISC_REG_DEC_ERR_LATCH_LAST                       MMSYS_MISC_REG_DEC_ERR_LATCH_LAST
#define MMSYS_MISC_REG_DEC_ERR_LATCH_LAST_POS                   (1U)
#define MMSYS_MISC_REG_DEC_ERR_LATCH_LAST_LEN                   (1U)
#define MMSYS_MISC_REG_DEC_ERR_LATCH_LAST_MSK                   (((1U<<MMSYS_MISC_REG_DEC_ERR_LATCH_LAST_LEN)-1)<<MMSYS_MISC_REG_DEC_ERR_LATCH_LAST_POS)
#define MMSYS_MISC_REG_DEC_ERR_LATCH_LAST_UMSK                  (~(((1U<<MMSYS_MISC_REG_DEC_ERR_LATCH_LAST_LEN)-1)<<MMSYS_MISC_REG_DEC_ERR_LATCH_LAST_POS))
#define MMSYS_MISC_MMINFRA_DEC_ERR_LAT                          MMSYS_MISC_MMINFRA_DEC_ERR_LAT
#define MMSYS_MISC_MMINFRA_DEC_ERR_LAT_POS                      (8U)
#define MMSYS_MISC_MMINFRA_DEC_ERR_LAT_LEN                      (1U)
#define MMSYS_MISC_MMINFRA_DEC_ERR_LAT_MSK                      (((1U<<MMSYS_MISC_MMINFRA_DEC_ERR_LAT_LEN)-1)<<MMSYS_MISC_MMINFRA_DEC_ERR_LAT_POS)
#define MMSYS_MISC_MMINFRA_DEC_ERR_LAT_UMSK                     (~(((1U<<MMSYS_MISC_MMINFRA_DEC_ERR_LAT_LEN)-1)<<MMSYS_MISC_MMINFRA_DEC_ERR_LAT_POS))
#define MMSYS_MISC_MMINFRA_DEC_ERR_WRITE                        MMSYS_MISC_MMINFRA_DEC_ERR_WRITE
#define MMSYS_MISC_MMINFRA_DEC_ERR_WRITE_POS                    (9U)
#define MMSYS_MISC_MMINFRA_DEC_ERR_WRITE_LEN                    (1U)
#define MMSYS_MISC_MMINFRA_DEC_ERR_WRITE_MSK                    (((1U<<MMSYS_MISC_MMINFRA_DEC_ERR_WRITE_LEN)-1)<<MMSYS_MISC_MMINFRA_DEC_ERR_WRITE_POS)
#define MMSYS_MISC_MMINFRA_DEC_ERR_WRITE_UMSK                   (~(((1U<<MMSYS_MISC_MMINFRA_DEC_ERR_WRITE_LEN)-1)<<MMSYS_MISC_MMINFRA_DEC_ERR_WRITE_POS))
#define MMSYS_MISC_MMINFRA_DEC_ERR_SRC                          MMSYS_MISC_MMINFRA_DEC_ERR_SRC
#define MMSYS_MISC_MMINFRA_DEC_ERR_SRC_POS                      (12U)
#define MMSYS_MISC_MMINFRA_DEC_ERR_SRC_LEN                      (2U)
#define MMSYS_MISC_MMINFRA_DEC_ERR_SRC_MSK                      (((1U<<MMSYS_MISC_MMINFRA_DEC_ERR_SRC_LEN)-1)<<MMSYS_MISC_MMINFRA_DEC_ERR_SRC_POS)
#define MMSYS_MISC_MMINFRA_DEC_ERR_SRC_UMSK                     (~(((1U<<MMSYS_MISC_MMINFRA_DEC_ERR_SRC_LEN)-1)<<MMSYS_MISC_MMINFRA_DEC_ERR_SRC_POS))
#define MMSYS_MISC_MMINFRA_DEC_ERR_ID                           MMSYS_MISC_MMINFRA_DEC_ERR_ID
#define MMSYS_MISC_MMINFRA_DEC_ERR_ID_POS                       (16U)
#define MMSYS_MISC_MMINFRA_DEC_ERR_ID_LEN                       (8U)
#define MMSYS_MISC_MMINFRA_DEC_ERR_ID_MSK                       (((1U<<MMSYS_MISC_MMINFRA_DEC_ERR_ID_LEN)-1)<<MMSYS_MISC_MMINFRA_DEC_ERR_ID_POS)
#define MMSYS_MISC_MMINFRA_DEC_ERR_ID_UMSK                      (~(((1U<<MMSYS_MISC_MMINFRA_DEC_ERR_ID_LEN)-1)<<MMSYS_MISC_MMINFRA_DEC_ERR_ID_POS))

