bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/mmsys_misc_reg.h
/* 0x34 : mm_bus_dec_err_addr */
#define MMSYS_MISC_MM_BUS_DEC_ERR_ADDR_OFFSET                   (0x34)
#define MMSYS_MISC_MMINFRA_DEC_ERR_ADDR                         MMSYS_MISC_MMINFRA_DEC_ERR_ADDR
#define MMSYS_MISC_MMINFRA_DEC_ERR_ADDR_POS                     (0U)
#define MMSYS_MISC_MMINFRA_DEC_ERR_ADDR_LEN                     (32U)
#define MMSYS_MISC_MMINFRA_DEC_ERR_ADDR_MSK                     (((1U<<MMSYS_MISC_MMINFRA_DEC_ERR_ADDR_LEN)-1)<<MMSYS_MISC_MMINFRA_DEC_ERR_ADDR_POS)
#define MMSYS_MISC_MMINFRA_DEC_ERR_ADDR_UMSK                    (~(((1U<<MMSYS_MISC_MMINFRA_DEC_ERR_ADDR_LEN)-1)<<MMSYS_MISC_MMINFRA_DEC_ERR_ADDR_POS))

/* 0x38 : mcu_bus_dec_err */
#define MMSYS_MISC_MCU_BUS_DEC_ERR_OFFSET                       (0x38)
#define MMSYS_MISC_REG_DEC_ERR_CLR_MCU                          MMSYS_MISC_REG_DEC_ERR_CLR_MCU
#define MMSYS_MISC_REG_DEC_ERR_CLR_MCU_POS                      (0U)
#define MMSYS_MISC_REG_DEC_ERR_CLR_MCU_LEN                      (1U)
#define MMSYS_MISC_REG_DEC_ERR_CLR_MCU_MSK                      (((1U<<MMSYS_MISC_REG_DEC_ERR_CLR_MCU_LEN)-1)<<MMSYS_MISC_REG_DEC_ERR_CLR_MCU_POS)
#define MMSYS_MISC_REG_DEC_ERR_CLR_MCU_UMSK                     (~(((1U<<MMSYS_MISC_REG_DEC_ERR_CLR_MCU_LEN)-1)<<MMSYS_MISC_REG_DEC_ERR_CLR_MCU_POS))
#define MMSYS_MISC_REG_DEC_ERR_LAST_MCU                         MMSYS_MISC_REG_DEC_ERR_LAST_MCU
#define MMSYS_MISC_REG_DEC_ERR_LAST_MCU_POS                     (1U)
#define MMSYS_MISC_REG_DEC_ERR_LAST_MCU_LEN                     (1U)
#define MMSYS_MISC_REG_DEC_ERR_LAST_MCU_MSK                     (((1U<<MMSYS_MISC_REG_DEC_ERR_LAST_MCU_LEN)-1)<<MMSYS_MISC_REG_DEC_ERR_LAST_MCU_POS)
#define MMSYS_MISC_REG_DEC_ERR_LAST_MCU_UMSK                    (~(((1U<<MMSYS_MISC_REG_DEC_ERR_LAST_MCU_LEN)-1)<<MMSYS_MISC_REG_DEC_ERR_LAST_MCU_POS))
#define MMSYS_MISC_MCU_DEC_ERR_LAT                              MMSYS_MISC_MCU_DEC_ERR_LAT
#define MMSYS_MISC_MCU_DEC_ERR_LAT_POS                          (8U)
#define MMSYS_MISC_MCU_DEC_ERR_LAT_LEN                          (1U)
#define MMSYS_MISC_MCU_DEC_ERR_LAT_MSK                          (((1U<<MMSYS_MISC_MCU_DEC_ERR_LAT_LEN)-1)<<MMSYS_MISC_MCU_DEC_ERR_LAT_POS)
#define MMSYS_MISC_MCU_DEC_ERR_LAT_UMSK                         (~(((1U<<MMSYS_MISC_MCU_DEC_ERR_LAT_LEN)-1)<<MMSYS_MISC_MCU_DEC_ERR_LAT_POS))
#define MMSYS_MISC_MCU_DEC_ERR_WRITE                            MMSYS_MISC_MCU_DEC_ERR_WRITE
#define MMSYS_MISC_MCU_DEC_ERR_WRITE_POS                        (9U)
#define MMSYS_MISC_MCU_DEC_ERR_WRITE_LEN                        (1U)
#define MMSYS_MISC_MCU_DEC_ERR_WRITE_MSK                        (((1U<<MMSYS_MISC_MCU_DEC_ERR_WRITE_LEN)-1)<<MMSYS_MISC_MCU_DEC_ERR_WRITE_POS)
#define MMSYS_MISC_MCU_DEC_ERR_WRITE_UMSK                       (~(((1U<<MMSYS_MISC_MCU_DEC_ERR_WRITE_LEN)-1)<<MMSYS_MISC_MCU_DEC_ERR_WRITE_POS))
#define MMSYS_MISC_MCU_DEC_ERR_SRC                              MMSYS_MISC_MCU_DEC_ERR_SRC
#define MMSYS_MISC_MCU_DEC_ERR_SRC_POS                          (12U)
#define MMSYS_MISC_MCU_DEC_ERR_SRC_LEN                          (1U)
#define MMSYS_MISC_MCU_DEC_ERR_SRC_MSK                          (((1U<<MMSYS_MISC_MCU_DEC_ERR_SRC_LEN)-1)<<MMSYS_MISC_MCU_DEC_ERR_SRC_POS)
#define MMSYS_MISC_MCU_DEC_ERR_SRC_UMSK                         (~(((1U<<MMSYS_MISC_MCU_DEC_ERR_SRC_LEN)-1)<<MMSYS_MISC_MCU_DEC_ERR_SRC_POS))
#define MMSYS_MISC_MCU_DEC_ERR_ID                               MMSYS_MISC_MCU_DEC_ERR_ID
#define MMSYS_MISC_MCU_DEC_ERR_ID_POS                           (16U)
#define MMSYS_MISC_MCU_DEC_ERR_ID_LEN                           (5U)
#define MMSYS_MISC_MCU_DEC_ERR_ID_MSK                           (((1U<<MMSYS_MISC_MCU_DEC_ERR_ID_LEN)-1)<<MMSYS_MISC_MCU_DEC_ERR_ID_POS)
#define MMSYS_MISC_MCU_DEC_ERR_ID_UMSK                          (~(((1U<<MMSYS_MISC_MCU_DEC_ERR_ID_LEN)-1)<<MMSYS_MISC_MCU_DEC_ERR_ID_POS))

/* 0x3C : mcu_bus_dec_err_addr */
#define MMSYS_MISC_MCU_BUS_DEC_ERR_ADDR_OFFSET                  (0x3C)
#define MMSYS_MISC_MCU_DEC_ERR_ADDR                             MMSYS_MISC_MCU_DEC_ERR_ADDR
#define MMSYS_MISC_MCU_DEC_ERR_ADDR_POS                         (0U)
#define MMSYS_MISC_MCU_DEC_ERR_ADDR_LEN                         (32U)
#define MMSYS_MISC_MCU_DEC_ERR_ADDR_MSK                         (((1U<<MMSYS_MISC_MCU_DEC_ERR_ADDR_LEN)-1)<<MMSYS_MISC_MCU_DEC_ERR_ADDR_POS)
#define MMSYS_MISC_MCU_DEC_ERR_ADDR_UMSK                        (~(((1U<<MMSYS_MISC_MCU_DEC_ERR_ADDR_LEN)-1)<<MMSYS_MISC_MCU_DEC_ERR_ADDR_POS))

/* 0x40 : dma_clk_ctrl */
#define MMSYS_MISC_DMA_CLK_CTRL_OFFSET                          (0x40)
#define MMSYS_MISC_DMA_CLK_EN                                   MMSYS_MISC_DMA_CLK_EN
#define MMSYS_MISC_DMA_CLK_EN_POS                               (0U)
#define MMSYS_MISC_DMA_CLK_EN_LEN                               (8U)
#define MMSYS_MISC_DMA_CLK_EN_MSK                               (((1U<<MMSYS_MISC_DMA_CLK_EN_LEN)-1)<<MMSYS_MISC_DMA_CLK_EN_POS)
#define MMSYS_MISC_DMA_CLK_EN_UMSK                              (~(((1U<<MMSYS_MISC_DMA_CLK_EN_LEN)-1)<<MMSYS_MISC_DMA_CLK_EN_POS))

/* 0x50 : vram_ctrl */
#define MMSYS_MISC_VRAM_CTRL_OFFSET                             (0x50)
#define MMSYS_MISC_REG_SYSRAM_SET                               MMSYS_MISC_REG_SYSRAM_SET
#define MMSYS_MISC_REG_SYSRAM_SET_POS                           (0U)
#define MMSYS_MISC_REG_SYSRAM_SET_LEN                           (1U)
#define MMSYS_MISC_REG_SYSRAM_SET_MSK                           (((1U<<MMSYS_MISC_REG_SYSRAM_SET_LEN)-1)<<MMSYS_MISC_REG_SYSRAM_SET_POS)
#define MMSYS_MISC_REG_SYSRAM_SET_UMSK                          (~(((1U<<MMSYS_MISC_REG_SYSRAM_SET_LEN)-1)<<MMSYS_MISC_REG_SYSRAM_SET_POS))
#define MMSYS_MISC_REG_PF_SRAM_REL                              MMSYS_MISC_REG_PF_SRAM_REL
#define MMSYS_MISC_REG_PF_SRAM_REL_POS                          (1U)
#define MMSYS_MISC_REG_PF_SRAM_REL_LEN                          (2U)
#define MMSYS_MISC_REG_PF_SRAM_REL_MSK                          (((1U<<MMSYS_MISC_REG_PF_SRAM_REL_LEN)-1)<<MMSYS_MISC_REG_PF_SRAM_REL_POS)
#define MMSYS_MISC_REG_PF_SRAM_REL_UMSK                         (~(((1U<<MMSYS_MISC_REG_PF_SRAM_REL_LEN)-1)<<MMSYS_MISC_REG_PF_SRAM_REL_POS))
#define MMSYS_MISC_REG_L2_SRAM_REL                              MMSYS_MISC_REG_L2_SRAM_REL
#define MMSYS_MISC_REG_L2_SRAM_REL_POS                          (4U)
#define MMSYS_MISC_REG_L2_SRAM_REL_LEN                          (1U)
#define MMSYS_MISC_REG_L2_SRAM_REL_MSK                          (((1U<<MMSYS_MISC_REG_L2_SRAM_REL_LEN)-1)<<MMSYS_MISC_REG_L2_SRAM_REL_POS)
#define MMSYS_MISC_REG_L2_SRAM_REL_UMSK                         (~(((1U<<MMSYS_MISC_REG_L2_SRAM_REL_LEN)-1)<<MMSYS_MISC_REG_L2_SRAM_REL_POS))
#define MMSYS_MISC_REG_SPP_SRAM_REL                             MMSYS_MISC_REG_SPP_SRAM_REL
#define MMSYS_MISC_REG_SPP_SRAM_REL_POS                         (6U)
#define MMSYS_MISC_REG_SPP_SRAM_REL_LEN                         (1U)
#define MMSYS_MISC_REG_SPP_SRAM_REL_MSK                         (((1U<<MMSYS_MISC_REG_SPP_SRAM_REL_LEN)-1)<<MMSYS_MISC_REG_SPP_SRAM_REL_POS)
#define MMSYS_MISC_REG_SPP_SRAM_REL_UMSK                        (~(((1U<<MMSYS_MISC_REG_SPP_SRAM_REL_LEN)-1)<<MMSYS_MISC_REG_SPP_SRAM_REL_POS))
#define MMSYS_MISC_REG_APU_SRAM_REL                             MMSYS_MISC_REG_APU_SRAM_REL
#define MMSYS_MISC_REG_APU_SRAM_REL_POS                         (7U)
#define MMSYS_MISC_REG_APU_SRAM_REL_LEN                         (1U)
#define MMSYS_MISC_REG_APU_SRAM_REL_MSK                         (((1U<<MMSYS_MISC_REG_APU_SRAM_REL_LEN)-1)<<MMSYS_MISC_REG_APU_SRAM_REL_POS)
#define MMSYS_MISC_REG_APU_SRAM_REL_UMSK                        (~(((1U<<MMSYS_MISC_REG_APU_SRAM_REL_LEN)-1)<<MMSYS_MISC_REG_APU_SRAM_REL_POS))

/* 0x60 : l1c_config */
#define MMSYS_MISC_L1C_CONFIG_OFFSET                            (0x60)
#define MMSYS_MISC_L1C_CACHEABLE                                MMSYS_MISC_L1C_CACHEABLE
#define MMSYS_MISC_L1C_CACHEABLE_POS                            (0U)
#define MMSYS_MISC_L1C_CACHEABLE_LEN                            (1U)
#define MMSYS_MISC_L1C_CACHEABLE_MSK                            (((1U<<MMSYS_MISC_L1C_CACHEABLE_LEN)-1)<<MMSYS_MISC_L1C_CACHEABLE_POS)
#define MMSYS_MISC_L1C_CACHEABLE_UMSK                           (~(((1U<<MMSYS_MISC_L1C_CACHEABLE_LEN)-1)<<MMSYS_MISC_L1C_CACHEABLE_POS))
#define MMSYS_MISC_L1C_CNT_EN                                   MMSYS_MISC_L1C_CNT_EN
#define MMSYS_MISC_L1C_CNT_EN_POS                               (1U)
#define MMSYS_MISC_L1C_CNT_EN_LEN                               (1U)
#define MMSYS_MISC_L1C_CNT_EN_MSK                               (((1U<<MMSYS_MISC_L1C_CNT_EN_LEN)-1)<<MMSYS_MISC_L1C_CNT_EN_POS)
#define MMSYS_MISC_L1C_CNT_EN_UMSK                              (~(((1U<<MMSYS_MISC_L1C_CNT_EN_LEN)-1)<<MMSYS_MISC_L1C_CNT_EN_POS))
#define MMSYS_MISC_L1C_INVALID                                  MMSYS_MISC_L1C_INVALID
#define MMSYS_MISC_L1C_INVALID_POS                              (2U)
#define MMSYS_MISC_L1C_INVALID_LEN                              (1U)
#define MMSYS_MISC_L1C_INVALID_MSK                              (((1U<<MMSYS_MISC_L1C_INVALID_LEN)-1)<<MMSYS_MISC_L1C_INVALID_POS)
#define MMSYS_MISC_L1C_INVALID_UMSK                             (~(((1U<<MMSYS_MISC_L1C_INVALID_LEN)-1)<<MMSYS_MISC_L1C_INVALID_POS))
#define MMSYS_MISC_L1C_INVALID_DONE                             MMSYS_MISC_L1C_INVALID_DONE
#define MMSYS_MISC_L1C_INVALID_DONE_POS                         (3U)
#define MMSYS_MISC_L1C_INVALID_DONE_LEN                         (1U)
#define MMSYS_MISC_L1C_INVALID_DONE_MSK                         (((1U<<MMSYS_MISC_L1C_INVALID_DONE_LEN)-1)<<MMSYS_MISC_L1C_INVALID_DONE_POS)
#define MMSYS_MISC_L1C_INVALID_DONE_UMSK                        (~(((1U<<MMSYS_MISC_L1C_INVALID_DONE_LEN)-1)<<MMSYS_MISC_L1C_INVALID_DONE_POS))
#define MMSYS_MISC_L1C_WAY_DIS                                  MMSYS_MISC_L1C_WAY_DIS
#define MMSYS_MISC_L1C_WAY_DIS_POS                              (8U)
#define MMSYS_MISC_L1C_WAY_DIS_LEN                              (4U)
#define MMSYS_MISC_L1C_WAY_DIS_MSK                              (((1U<<MMSYS_MISC_L1C_WAY_DIS_LEN)-1)<<MMSYS_MISC_L1C_WAY_DIS_POS)
#define MMSYS_MISC_L1C_WAY_DIS_UMSK                             (~(((1U<<MMSYS_MISC_L1C_WAY_DIS_LEN)-1)<<MMSYS_MISC_L1C_WAY_DIS_POS))
#define MMSYS_MISC_L1C_AUX_EN                                   MMSYS_MISC_L1C_AUX_EN
#define MMSYS_MISC_L1C_AUX_EN_POS                               (13U)
#define MMSYS_MISC_L1C_AUX_EN_LEN                               (1U)
#define MMSYS_MISC_L1C_AUX_EN_MSK                               (((1U<<MMSYS_MISC_L1C_AUX_EN_LEN)-1)<<MMSYS_MISC_L1C_AUX_EN_POS)
#define MMSYS_MISC_L1C_AUX_EN_UMSK                              (~(((1U<<MMSYS_MISC_L1C_AUX_EN_LEN)-1)<<MMSYS_MISC_L1C_AUX_EN_POS))
#define MMSYS_MISC_L1C_BYPASS                                   MMSYS_MISC_L1C_BYPASS
#define MMSYS_MISC_L1C_BYPASS_POS                               (14U)
#define MMSYS_MISC_L1C_BYPASS_LEN                               (1U)
#define MMSYS_MISC_L1C_BYPASS_MSK                               (((1U<<MMSYS_MISC_L1C_BYPASS_LEN)-1)<<MMSYS_MISC_L1C_BYPASS_POS)
#define MMSYS_MISC_L1C_BYPASS_UMSK                              (~(((1U<<MMSYS_MISC_L1C_BYPASS_LEN)-1)<<MMSYS_MISC_L1C_BYPASS_POS))
#define MMSYS_MISC_L1C_EARLY_RESP_DIS                           MMSYS_MISC_L1C_EARLY_RESP_DIS
#define MMSYS_MISC_L1C_EARLY_RESP_DIS_POS                       (15U)
#define MMSYS_MISC_L1C_EARLY_RESP_DIS_LEN                       (1U)
#define MMSYS_MISC_L1C_EARLY_RESP_DIS_MSK                       (((1U<<MMSYS_MISC_L1C_EARLY_RESP_DIS_LEN)-1)<<MMSYS_MISC_L1C_EARLY_RESP_DIS_POS)
#define MMSYS_MISC_L1C_EARLY_RESP_DIS_UMSK                      (~(((1U<<MMSYS_MISC_L1C_EARLY_RESP_DIS_LEN)-1)<<MMSYS_MISC_L1C_EARLY_RESP_DIS_POS))
#define MMSYS_MISC_L1C_RANGE                                    MMSYS_MISC_L1C_RANGE
#define MMSYS_MISC_L1C_RANGE_POS                                (16U)
#define MMSYS_MISC_L1C_RANGE_LEN                                (8U)
#define MMSYS_MISC_L1C_RANGE_MSK                                (((1U<<MMSYS_MISC_L1C_RANGE_LEN)-1)<<MMSYS_MISC_L1C_RANGE_POS)
#define MMSYS_MISC_L1C_RANGE_UMSK                               (~(((1U<<MMSYS_MISC_L1C_RANGE_LEN)-1)<<MMSYS_MISC_L1C_RANGE_POS))

/* 0x64 : l1c_hit_cnt_lsb */
#define MMSYS_MISC_L1C_HIT_CNT_LSB_OFFSET                       (0x64)
#define MMSYS_MISC_L1C_HIT_CNT_LSB                              MMSYS_MISC_L1C_HIT_CNT_LSB
#define MMSYS_MISC_L1C_HIT_CNT_LSB_POS                          (0U)
#define MMSYS_MISC_L1C_HIT_CNT_LSB_LEN                          (32U)
#define MMSYS_MISC_L1C_HIT_CNT_LSB_MSK                          (((1U<<MMSYS_MISC_L1C_HIT_CNT_LSB_LEN)-1)<<MMSYS_MISC_L1C_HIT_CNT_LSB_POS)
#define MMSYS_MISC_L1C_HIT_CNT_LSB_UMSK                         (~(((1U<<MMSYS_MISC_L1C_HIT_CNT_LSB_LEN)-1)<<MMSYS_MISC_L1C_HIT_CNT_LSB_POS))

