bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/mmsys_misc_reg.h
/* 0x68 : l1c_hit_cnt_msb */
#define MMSYS_MISC_L1C_HIT_CNT_MSB_OFFSET                       (0x68)
#define MMSYS_MISC_L1C_HIT_CNT_MSB                              MMSYS_MISC_L1C_HIT_CNT_MSB
#define MMSYS_MISC_L1C_HIT_CNT_MSB_POS                          (0U)
#define MMSYS_MISC_L1C_HIT_CNT_MSB_LEN                          (32U)
#define MMSYS_MISC_L1C_HIT_CNT_MSB_MSK                          (((1U<<MMSYS_MISC_L1C_HIT_CNT_MSB_LEN)-1)<<MMSYS_MISC_L1C_HIT_CNT_MSB_POS)
#define MMSYS_MISC_L1C_HIT_CNT_MSB_UMSK                         (~(((1U<<MMSYS_MISC_L1C_HIT_CNT_MSB_LEN)-1)<<MMSYS_MISC_L1C_HIT_CNT_MSB_POS))

/* 0x6C : l1c_miss_cnt */
#define MMSYS_MISC_L1C_MISS_CNT_OFFSET                          (0x6C)
#define MMSYS_MISC_L1C_MISS_CNT                                 MMSYS_MISC_L1C_MISS_CNT
#define MMSYS_MISC_L1C_MISS_CNT_POS                             (0U)
#define MMSYS_MISC_L1C_MISS_CNT_LEN                             (32U)
#define MMSYS_MISC_L1C_MISS_CNT_MSK                             (((1U<<MMSYS_MISC_L1C_MISS_CNT_LEN)-1)<<MMSYS_MISC_L1C_MISS_CNT_POS)
#define MMSYS_MISC_L1C_MISS_CNT_UMSK                            (~(((1U<<MMSYS_MISC_L1C_MISS_CNT_LEN)-1)<<MMSYS_MISC_L1C_MISS_CNT_POS))

/* 0xFC : mmsys_misc_dummy */
#define MMSYS_MISC_DUMMY_OFFSET                                 (0xFC)
#define MMSYS_MISC_DUMMY_REG                                    MMSYS_MISC_DUMMY_REG
#define MMSYS_MISC_DUMMY_REG_POS                                (0U)
#define MMSYS_MISC_DUMMY_REG_LEN                                (32U)
#define MMSYS_MISC_DUMMY_REG_MSK                                (((1U<<MMSYS_MISC_DUMMY_REG_LEN)-1)<<MMSYS_MISC_DUMMY_REG_POS)
#define MMSYS_MISC_DUMMY_REG_UMSK                               (~(((1U<<MMSYS_MISC_DUMMY_REG_LEN)-1)<<MMSYS_MISC_DUMMY_REG_POS))

/* 0x100 : DDR_debug */
#define MMSYS_MISC_DDR_DEBUG_OFFSET                             (0x100)
#define MMSYS_MISC_DDR_CALIB_DONE                               MMSYS_MISC_DDR_CALIB_DONE
#define MMSYS_MISC_DDR_CALIB_DONE_POS                           (0U)
#define MMSYS_MISC_DDR_CALIB_DONE_LEN                           (1U)
#define MMSYS_MISC_DDR_CALIB_DONE_MSK                           (((1U<<MMSYS_MISC_DDR_CALIB_DONE_LEN)-1)<<MMSYS_MISC_DDR_CALIB_DONE_POS)
#define MMSYS_MISC_DDR_CALIB_DONE_UMSK                          (~(((1U<<MMSYS_MISC_DDR_CALIB_DONE_LEN)-1)<<MMSYS_MISC_DDR_CALIB_DONE_POS))


struct  mmsys_misc_reg {
    /* 0x0 : a5_boot */
    union {
        struct {
            uint32_t reg_a5_boot_en                 :  1; /* [    0],        r/w,        0x0 */
            uint32_t reg_a5_boot_addr               : 31; /* [31: 1],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } a5_boot;

    /* 0x4  reserved */
    uint8_t RESERVED0x4[28];

    /* 0x20 : peri_apb_ctrl */
    union {
        struct {
            uint32_t rg_pclk_force_on               : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31                 : 16; /* [31:16],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } peri_apb_ctrl;

    /* 0x24  reserved */
    uint8_t RESERVED0x24[8];

    /* 0x2C : mm_infra_qos_ctrl */
    union {
        struct {
            uint32_t reg_dma_awqos                  :  1; /* [    0],        r/w,        0x0 */
            uint32_t reg_dma_arqos                  :  1; /* [    1],        r/w,        0x0 */
            uint32_t reg_a5m0_awqos                 :  1; /* [    2],        r/w,        0x0 */
            uint32_t reg_a5m0_arqos                 :  1; /* [    3],        r/w,        0x0 */
            uint32_t reg_a5m1_awqos                 :  1; /* [    4],        r/w,        0x0 */
            uint32_t reg_a5m1_arqos                 :  1; /* [    5],        r/w,        0x0 */
            uint32_t reg_2ddma_awqos                :  1; /* [    6],        r/w,        0x0 */
            uint32_t reg_2ddma_arqos                :  1; /* [    7],        r/w,        0x0 */
            uint32_t reg_sdh_awqos                  :  1; /* [    8],        r/w,        0x0 */
            uint32_t reg_sdh_arqos                  :  1; /* [    9],        r/w,        0x0 */
            uint32_t reserved_10_15                 :  6; /* [15:10],       rsvd,        0x0 */
            uint32_t reg_w_issue_thre_mm2conn       :  3; /* [18:16],        r/w,        0x0 */
            uint32_t reserved_19                    :  1; /* [   19],       rsvd,        0x0 */
            uint32_t reg_w_issue_thre_conn2mm       :  3; /* [22:20],        r/w,        0x0 */
            uint32_t reserved_23_31                 :  9; /* [31:23],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mm_infra_qos_ctrl;

    /* 0x30 : mm_bus_dec_err */
    union {
        struct {
            uint32_t reg_dec_err_clr                :  1; /* [    0],        w1p,        0x0 */
            uint32_t reg_dec_err_latch_last         :  1; /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_7                   :  6; /* [ 7: 2],       rsvd,        0x0 */
            uint32_t mminfra_dec_err_lat            :  1; /* [    8],          r,        0x0 */
            uint32_t mminfra_dec_err_write          :  1; /* [    9],          r,        0x0 */
            uint32_t reserved_10_11                 :  2; /* [11:10],       rsvd,        0x0 */
            uint32_t mminfra_dec_err_src            :  2; /* [13:12],          r,        0x0 */
            uint32_t reserved_14_15                 :  2; /* [15:14],       rsvd,        0x0 */
            uint32_t mminfra_dec_err_id             :  8; /* [23:16],          r,        0x0 */
            uint32_t reserved_24_31                 :  8; /* [31:24],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mm_bus_dec_err;

    /* 0x34 : mm_bus_dec_err_addr */
    union {
        struct {
            uint32_t mminfra_dec_err_addr           : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mm_bus_dec_err_addr;

    /* 0x38 : mcu_bus_dec_err */
    union {
        struct {
            uint32_t reg_dec_err_clr_mcu            :  1; /* [    0],        w1p,        0x0 */
            uint32_t reg_dec_err_last_mcu           :  1; /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_7                   :  6; /* [ 7: 2],       rsvd,        0x0 */
            uint32_t mcu_dec_err_lat                :  1; /* [    8],          r,        0x0 */
            uint32_t mcu_dec_err_write              :  1; /* [    9],          r,        0x0 */
            uint32_t reserved_10_11                 :  2; /* [11:10],       rsvd,        0x0 */
            uint32_t mcu_dec_err_src                :  1; /* [   12],          r,        0x0 */
            uint32_t reserved_13_15                 :  3; /* [15:13],       rsvd,        0x0 */
            uint32_t mcu_dec_err_id                 :  5; /* [20:16],          r,        0x0 */
            uint32_t reserved_21_31                 : 11; /* [31:21],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mcu_bus_dec_err;

