bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/mmsys_misc_reg.h
    /* 0x3C : mcu_bus_dec_err_addr */
    union {
        struct {
            uint32_t mcu_dec_err_addr               : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } mcu_bus_dec_err_addr;

    /* 0x40 : dma_clk_ctrl */
    union {
        struct {
            uint32_t dma_clk_en                     :  8; /* [ 7: 0],        r/w,       0xff */
            uint32_t reserved_8_31                  : 24; /* [31: 8],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } dma_clk_ctrl;

    /* 0x44  reserved */
    uint8_t RESERVED0x44[12];

    /* 0x50 : vram_ctrl */
    union {
        struct {
            uint32_t reg_sysram_set                 :  1; /* [    0],        w1p,        0x0 */
            uint32_t reg_l2_sram_rel                :  3; /* [ 3: 1],        r/w,        0x3 */
            uint32_t reg_pf_sram_rel                :  3; /* [ 6: 4],        r/w,        0x0 */
            uint32_t reg_apu_sram_rel               :  1; /* [    7],        r/w,        0x0 */
            uint32_t reg_spp_sram_rel               :  1; /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_31                  : 23; /* [31: 9],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } vram_ctrl;

    /* 0x54  reserved */
    uint8_t RESERVED0x54[12];

    /* 0x60 : l1c_config */
    union {
        struct {
            uint32_t l1c_cacheable                  :  1; /* [    0],        r/w,        0x0 */
            uint32_t l1c_cnt_en                     :  1; /* [    1],        r/w,        0x0 */
            uint32_t l1c_invalid                    :  1; /* [    2],        r/w,        0x0 */
            uint32_t l1c_invalid_done               :  1; /* [    3],          r,        0x0 */
            uint32_t reserved_4_7                   :  4; /* [ 7: 4],       rsvd,        0x0 */
            uint32_t l1c_way_dis                    :  4; /* [11: 8],        r/w,        0xf */
            uint32_t reserved_12                    :  1; /* [   12],       rsvd,        0x0 */
            uint32_t l1c_aux_en                     :  1; /* [   13],        r/w,        0x1 */
            uint32_t l1c_bypass                     :  1; /* [   14],        r/w,        0x1 */
            uint32_t l1c_early_resp_dis             :  1; /* [   15],        r/w,        0x0 */
            uint32_t l1c_range                      :  8; /* [23:16],        r/w,       0x20 */
            uint32_t reserved_24_31                 :  8; /* [31:24],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } l1c_config;

    /* 0x64 : l1c_hit_cnt_lsb */
    union {
        struct {
            uint32_t l1c_hit_cnt_lsb                : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } l1c_hit_cnt_lsb;

    /* 0x68 : l1c_hit_cnt_msb */
    union {
        struct {
            uint32_t l1c_hit_cnt_msb                : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } l1c_hit_cnt_msb;

    /* 0x6C : l1c_miss_cnt */
    union {
        struct {
            uint32_t l1c_miss_cnt                   : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } l1c_miss_cnt;

    /* 0x70  reserved */
    uint8_t RESERVED0x70[140];

    /* 0xFC : mmsys_misc_dummy */
    union {
        struct {
            uint32_t dummy_reg                      : 32; /* [31: 0],        r/w, 0xffff0000 */
        }BF;
        uint32_t WORD;
    } mmsys_misc_dummy;

    /* 0x100 : DDR_debug */
    union {
        struct {
            uint32_t ddr_calib_done                 :  1; /* [    0],          r,        0x0 */
            uint32_t reserved_1_31                  : 31; /* [31: 1],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } DDR_debug;

};

typedef volatile struct mmsys_misc_reg mmsys_misc_reg_t;

#define MMSYS_MISC_GPIO_OFFSET              0x200
#define MMSYS_MISC_GPIO_INPUT_OFFSET        0x2A0
#define MMSYS_MISC_GPIO_OUTPUT_OFFSET       0x2B0
#define MMSYS_MISC_GPIO_OUTPUT_EN_OFFSET    0x2C0

#endif  /* __MMSYS_MISC_REG_H__ */
